writeup/paper_outline.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-10-30 Thu 10:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>A Rigorous, Interpretable Genetic Algorithm Framework Reveals Statistically Significant Gene Signatures in Parkinson's Disease Single-Cell Data</title>
<meta name="author" content="Sam Neaves" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">A Rigorous, Interpretable Genetic Algorithm Framework Reveals Statistically Significant Gene Signatures in Parkinson's Disease Single-Cell Data</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgcf16eed">1. Abstract</a></li>
<li><a href="#org9d02c4e">2. Introduction</a></li>
<li><a href="#org10ea020">3. Methods</a>
<ul>
<li><a href="#org57cfec1">3.1. Single-Cell Data Preprocessing:</a></li>
<li><a href="#orgf2007a1">3.2. The Genetic Algorithm Framework:</a>
<ul>
<li><a href="#orgd9f449d">3.2.1. </a></li>
<li><a href="#orgddfc856">3.2.2. A Diverse Subgroup Set Discovery (DSSD) Fitness Function</a></li>
</ul>
</li>
<li><a href="#orga652b7d">3.3. Statistical Validation: The "Best-of-N-Repeats" Permutation Test:</a></li>
</ul>
</li>
<li><a href="#org04ad2c1">4. HPC Implementation:</a></li>
<li><a href="#orgd09fad6">5. Results</a></li>
<li><a href="#orge197e55">6. Discussion</a></li>
<li><a href="#orgd5f4ef5">7. Conclusion:</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgcf16eed" class="outline-2">
<h2 id="orgcf16eed"><span class="section-number-2">1.</span> Abstract</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Background:
Briefly state the challenge: Parkinson's Disease (PD) is
heterogeneous, and single-cell (scRNA-seq) data offers a window into
this, but discovering the complex, combinatorial gene patterns that
define disease subgroups is difficult. Standard methods (like
differential expression) are too simple, while "black-box" AI models
(like deep learning) are not interpretable by biologists.</li>
</ul>


<ul class="org-ul">
<li>Methodology:
We applied an interpretable subgroup discovery framework using a
Genetic Algorithm (GA) to a high-dimensional scRNA-seq dataset of
dopaminergic neurons from PD patients and controls. Our method
evolves sets of human-readable, IF-THEN logical rules to identify
disease-associated subgroups.</li>
</ul>


<ul class="org-ul">
<li>Rigor:
To validate our findings and ensure they were not statistical
artifacts from searching a high-dimensional space, we performed a
massive-scale permutation test (1000 permutations). This involved
over 200,000 independent GA runs and consumed ~10,000 GPU-hours on
the DAWN supercomputer.</li>
</ul>


<ul class="org-ul">
<li>Results:
The GA identified a novel, non-obvious rule set (a combination of
gene expression states) that was highly statistically significant
(empirical p &lt; 0.001). This rule set achieved a fitness on the real
data that was not matched by any of the 999 permuted (randomized)
datasets. The resulting rules point to a combinatorial signature
involving genes such as [Gene A, Gene B, Gene C&#x2026;].</li>
</ul>


<ul class="org-ul">
<li>Conclusion:
This work provides a statistically-validated, interpretable, and
biologically relevant hypothesis for PD pathogenesis. It also
demonstrates a powerful, generalizable framework for applying
interpretable AI with large-scale HPC to extract robust, testable
insights from complex single-cell data.</li>
</ul>
</div>
</div>


<div id="outline-container-org9d02c4e" class="outline-2">
<h2 id="org9d02c4e"><span class="section-number-2">2.</span> Introduction</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>The Biological Problem:
Start with Parkinson's Disease. It's a complex, devastating
neurodegenerative disease. Its progression and presentation are
highly heterogeneous, suggesting multiple underlying mechanisms or
patient subgroups.</li>
</ul>


<ul class="org-ul">
<li>The Data Opportunity:
The emergence of single-cell RNA sequencing (scRNA-seq) allows us,
for the first time, to probe this heterogeneity at the resolution of
individual cells, like the vulnerable dopaminergic neurons.</li>
</ul>


<ul class="org-ul">
<li><p>
The "Interpretability Gap" (Your Justification):
This is your key argument.
</p>

<p>
State that simple statistical methods (like differential gene
expression) are useful but limited, as they only find individual
gene changes and miss the combinatorial logic of biological
pathways.
</p></li>
</ul>


<p>
State that "black-box" machine learning (e.g., Deep Learning, SVMs)
can be highly predictive but fail to provide interpretable
insights. A 95% accurate model is useless to a biologist if it
cannot explain why it made its decision.
</p>


<p>
This creates a need for methods that are both powerful (can search
high-dimensional, combinatorial spaces) and interpretable (produce
human-readable, testable hypotheses).
</p>


<ul class="org-ul">
<li>Our Framework (GA + Rigor):
Introduce your solution.
Propose the use of a rule-based Genetic Algorithm, a class of
evolutionary algorithm well-suited for complex combinatorial
optimization. Our framework is specifically designed for Diverse
Subgroup Set Discovery (DSSD). We hypothesize that Parkinson's is
not a monolithic disease but a heterogeneous condition with
multiple, distinct dysfunctional cell states. Therefore, unlike
standard methods that find a single 'best' rule, our GA evolves a
set of rules, where the entire set is evaluated for quality and
diversity. Each chromosome in our GA represents a model of this
heterogeneity, with each rule potentially identifying a distinct
biological subgroup. To validate these models, we paired the GA with a massive-scale permutation</li>
</ul>
<p>
test&#x2026;"
</p>

<p>
"Critically, we implemented this GA in PyTorch to leverage GPU parallelization, transforming the computationally infeasible task of a 1000-permutation test into a tractable one."
</p>

<ul class="org-ul">
<li>Justify the GA:
Explicitly state it was chosen because it produces interpretable IF-THEN rules that represent gene combinations.</li>

<li>Justify the Rigor:
State that to overcome the risk of "p-hacking" or finding spurious
correlations in the high-dimensional data, you paired the GA with a
massive-scale permutation test.</li>
</ul>


<ul class="org-ul">
<li>Punchline:
In this paper, we apply this rigorous, interpretable framework to a
[Your Data] scRNA-seq dataset. We leverage the DAWN HPC system to
perform ~10,000 GPU-hours of computation, resulting in the discovery
of a statistically significant (p &lt; 0.001) and interpretable gene
signature for a PD subgroup.</li>
</ul>
</div>
</div>

<div id="outline-container-org10ea020" class="outline-2">
<h2 id="org10ea020"><span class="section-number-2">3.</span> Methods</h2>
<div class="outline-text-2" id="text-3">
<p>
This section must be crystal clear and reproducible.
</p>
</div>

<div id="outline-container-org57cfec1" class="outline-3">
<h3 id="org57cfec1"><span class="section-number-3">3.1.</span> Single-Cell Data Preprocessing:</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Source: Describe the SNatlas<sub>DaNs</sub><sub>seurat.RData</sub> object.</li>

<li>Filtering: Detail the cell filtering (e.g., keeping only CTR and PD labels PD<sub>B5</sub>-6, PD<sub>B3</sub>-4, resulting in 6,385 cells).</li>

<li>Confounder Correction: State that you used SCTransform to normalize data and simultaneously regress out the donor batch effect (the Sample<sub>v2</sub> variable). This is crucial for rigor.</li>

<li>Feature Selection: Explain that you performed a DE test on the corrected data and selected the top 1000 most variant genes for the GA, balancing computational feasibility with discovery.</li>

<li>Binarization: Describe the z-scoring method ((expression - mean) / std<sub>dev</sub>) and binarization (&gt; 0 -&gt; 1, &lt;= 0 -&gt; 0) to create the final 6385 x 1000 input matrix.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf2007a1" class="outline-3">
<h3 id="orgf2007a1"><span class="section-number-3">3.2.</span> The Genetic Algorithm Framework:</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-orgd9f449d" class="outline-4">
<h4 id="orgd9f449d"><span class="section-number-4">3.2.1.</span> </h4>
<div class="outline-text-4" id="text-3-2-1">
<ul class="org-ul">
<li>Chromosome Representation: Explain that each "individual" is a chromosome representing a set of k rules (where k was 3-6). Explain the "mask + value" structure for each rule (e.g., 2 * 1000 = 2000 bits per rule).</li>

<li>Fitness Function: This is critical. Define Fitness = Quality / Overlap.</li>

<li>Explain Quality = WRAcc(Union(Rules)). Justify WRAcc as a metric that balances subgroup size (support) and accuracy (lift).</li>

<li>Explain Overlap = TotalMatches / UniqueMatches as a penalty to encourage diverse, non-redundant rule sets.</li>

<li>GA Parameters: State them clearly: population<sub>size</sub>=55,
num<sub>generations</sub>=1000, tournament selection (size=5), single-point
crossover, bit-flip mutation (rate=0.0001), elitism (count=2).</li>
</ul>
</div>
</div>
