writeup/paper_outline.html

<div id="outline-container-orgddfc856" class="outline-4">
<h4 id="orgddfc856"><span class="section-number-4">3.2.2.</span> A Diverse Subgroup Set Discovery (DSSD) Fitness Function</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
Our primary goal was not to find the single <b>best</b> rule describing PD,
as this would ignore the known heterogeneity of the disease. Standard
subgroup discovery algorithms often suffer from redundancy, where the
top 10 "best" rules are trivial variations of each other, all
describing the same, largest subgroup.
</p>

<p>
To overcome this, we designed our framework for <b>Diverse Subgroup Set
Discovery (DSSD)</b>. The central hypothesis is that our GA chromosome,
as a set of rules:
</p>

<p>
\[
\{ \text{Rule}_1, \text{Rule}_2, \ldots, \text{Rule}_k \}
\]
</p>

<p>
can serve as an interpretable model of distinct cell states.
</p>

<p>
To force the GA to find such a set, we designed a custom,
set-based fitness function that simultaneously rewards both quality
(exploitation) and diversity (exploration):
</p>

<p>
\[
\text{Fitness} =
\frac{\text{Quality}\big(\text{Union}(\text{Rules})\big)}
     {\text{Overlap}(\text{Rules})}
\]
</p>

<ol class="org-ol">
<li><p>
<b>Quality (WRAcc of the Union)</b>  
The quality of a chromosome is measured by the Weighted Relative Accuracy (WRAcc)
of the union of all cells covered by its rules.
</p>

<p>
\[
   \text{WRAcc} = P(G) \times \big(P(\text{Class} \mid G) - P(\text{Class})\big)
   \]
</p>

<p>
where \( G \) is the subgroup.  
This metric balances <b>support</b> (the size of the total subgroup found, \( P(G) \))
with <b>lift</b> (the enrichment of PD cells in that subgroup,
\( P(\text{Class} \mid G) - P(\text{Class}) \)).
It rewards chromosomes that identify a large and highly enriched population of PD cells.
</p></li>

<li><p>
<b>Diversity (Overlap Penalty)</b>  
The denominator, <b>Overlap</b>, is a penalty for redundancy. It is defined as:
</p>

<p>
\[
   \text{Overlap} = \frac{\text{TotalMatches}}{\text{UniqueMatches}}
   \]
</p>

<p>
where <b>UniqueMatches</b> is the number of cells covered by the union (as in the quality metric),
and <b>TotalMatches</b> is the sum of cells covered by each rule individually.
If all rules in a set cover the exact same cells, the Overlap score will be high (equal to \( k \)),
heavily penalizing the chromosome’s fitness.
</p></li>
</ol>

<p>
<b>Interpretation:</b>  
This fitness function creates an evolutionary pressure that punishes redundant rule sets
and rewards sets where each rule identifies a different population of cells,
all while maintaining high overall enrichment for the PD phenotype.
A high-fitness chromosome is therefore interpreted as a model of distinct,
disease-associated cell states.
</p>

<p>
<b>*</b>
</p>

<p>
2.c. Scalable Implementation: A GPU-Accelerated Genetic Algorithm
While the DSSD fitness function defines what to find, a computationally efficient search algorithm is required to find it. Standard subgroup discovery implementations (e.g., in R or sequential Python) are often iterative, CPU-bound, and computationally slow. A single run on a dataset of this scale can take many minutes to hours.
</p>

<p>
This slowness makes a rigorous permutation test—which requires running the entire discovery process 1,000+ times—computationally infeasible.
</p>

<p>
To solve this, we adapted the DSSD framework to a Genetic Algorithm (GA), as the population-based nature of GAs is "embarrassingly parallel." We specifically designed our GA implementation to leverage massive GPU parallelization using PyTorch and the Intel Extension for PyTorch (IPEX).
</p>

<p>
The key adaptation was vectorizing the entire fitness calculation. Instead of iterating through each chromosome one by one, we:
</p>

<p>
Represented the entire population for a batch of permutations as a single large tensor [N, P, C], where N is the number of permutations (e.g., 16), P is the population size (e.g., 55), and C is the chromosome length.
</p>

<p>
Implemented the get<sub>rule</sub><sub>matches</sub> function as a series of large-scale tensor broadcast operations. This creates a massive intermediate tensor ([N, P, R, S, F]) that allows the GPU to check every rule, for every chromosome, for every permutation, against every sample, for every feature simultaneously.
</p>

<p>
All subsequent calculations (WRAcc, overlap) were also performed as parallel tensor operations, resulting in a fitness score for every chromosome in the batch.
</p>

<p>
This GPU-accelerated design is the critical enabler of our study. It collapses the runtime for a single, complex DSSD run (e.g., 1000 generations, pop=55) from hours on a CPU to approximately 2-3 minutes on a single Intel Max 1550 GPU.
</p>

<p>
This massive speedup is what made our "best-of-N-repeats" permutation test, which consumed ~10,000 GPU-hours in total, computationally feasible. It allowed us to apply the same intense search effort (200 repeats * 1000 generations) to both the real data and all 999 permuted datasets, ensuring statistical rigor.
</p>
</div>
</div>
</div>

<div id="outline-container-orga652b7d" class="outline-3">
<h3 id="orga652b7d"><span class="section-number-3">3.3.</span> Statistical Validation: The "Best-of-N-Repeats" Permutation Test:</h3>
<div class="outline-text-3" id="text-3-3">
<p>
This is your most impressive method. Explain it in detail.
</p>

<ul class="org-ul">
<li>Null Hypothesis: That the observed gene expression patterns are not associated with the PD/CTR labels.</li>

<li>Procedure: To test this, you created 1000 datasets (1 real + 999 permuted by shuffling labels).</li>

<li>Rigor Justification: To ensure a fair comparison, the exact same computational effort was applied to every single dataset.</li>

<li>Effort per Dataset: Define the effort: "Each of the 1000 datasets was searched by N=200 independent GA runs, each starting from a different random population. The single highest-fitness chromosome found across all 200 repeats was recorded as the 'best' result for that dataset."</li>

<li>P-Value Calculation: The empirical p-value is (count(F<sub>perm</sub><sub>i</sub> &gt;= F<sub>real</sub>) + 1) / (999 + 1).</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org04ad2c1" class="outline-2">
<h2 id="org04ad2c1"><span class="section-number-2">4.</span> HPC Implementation:</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Briefly state the GA was implemented in Python using PyTorch/IPEX for GPU acceleration.</li>

<li>Explain the experiment was executed as a 1000-task SLURM job array (&#x2013;array=0-999) on the DAWN supercomputer.</li>

<li>State the resource request (&#x2013;time=10:00:00, &#x2013;gres=gpu:1) and the
total cost: "This comprehensive, statistically rigorous search
consumed approximately 10,000 GPU-hours."</li>
</ul>
</div>
</div>



<div id="outline-container-orgd09fad6" class="outline-2">
<h2 id="orgd09fad6"><span class="section-number-2">5.</span> Results</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>A Statistically Significant Signature is Discovered:</li>

<li>State the main finding: "The 'best-of-200' search on the real data (Task 0) yielded a rule set with a fitness of [F<sub>real</sub>]."</li>

<li>"The distribution of 'best-of-200' fitness scores from the 999 permuted datasets had a mean of [Avg<sub>F</sub><sub>perm</sub>] and a maximum of [Max<sub>F</sub><sub>perm</sub>]."</li>

<li>"No permuted dataset achieved a fitness as high as the real data. This yields an empirical p-value of p &lt; 0.001 (0 observed / 999 permutations, +1/+1).</li>

<li>THE FIGURE: You must include a histogram here. It will show the beautiful bell curve of the 999 permuted fitness scores, with a single red line for your F<sub>real</sub> score sitting far to the right, all alone. This figure is the central proof of your paper.</li>

<li>The Interpretable PD Signature:</li>

<li>Present the winning rule set (the Rank 1 rules from the ga<sub>results</sub><sub>0.txt</sub> file).</li>

<li>List the rules clearly:</li>

<li>Rule 1: TPPP=0 AND SEC62=0 AND COX6C=0 &#x2026;</li>

<li><p>
Rule 2: NLGN4Y=0 AND COL5A1=0 &#x2026;
</p>

<p>
&#x2026;
</p></li>

<li>Subgroup Characterization (The so what):</li>
</ol>

<p>
Report the support (e.g., "This rule set identifies a subgroup of [X] cells&#x2026;") and precision (e.g., "&#x2026;of which [Y]% are PD cells, representing a [Z]-fold enrichment over baseline.")
</p>

<p>
(Optional, but powerful) Show a UMAP plot of all 6,385 cells, with the
cells identified by your rule set colored differently. Do they
cluster?
</p>
</div>
</div>
